АлогистикТест2/src/Documents/алк_АктСписанияПорт/алк_АктСписанияПорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_АктСписанияПорт</name>
  <basedOn>Document.алк_ТранспортировочныеПартии</basedOn>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыполнениеЗаказовЭтапыСерии</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаВнешнихСкладахСерии</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ТранспортировочныеПартии</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЭкспедитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/ОперацииСерийныхНомеров/ОперацииСерийныхНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииСерийныхНомеров</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Движение</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Переупаковка</name>
  </enumValues>
  <enumValues>
    <name>Расформирование</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Перевалка</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_АктСписанияПорт/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаАктСписанияПорт, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_АктСписанияПортЗапасы.СерийныйНомер,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	&Период,
		|	алк_АктСписанияПортЗапасы.Номенклатура,
		|	алк_АктСписанияПортЗапасы.КоличествоПакетов,
		|	алк_АктСписанияПортЗапасы.Ссылка.Заказ КАК ЗаказПокупателя,
		|	алк_АктСписанияПортЗапасы.Ссылка.Организация,
		|	алк_АктСписанияПортЗапасы.Ссылка.СтруктурнаяЕдиница
		|ИЗ
		|	Документ.алк_АктСписанияПорт.Запасы КАК алк_АктСписанияПортЗапасы
		|ГДЕ
		|	алк_АктСписанияПортЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_АктСписанияПортЗапасы.Номенклатура,
		|	алк_АктСписанияПортЗапасы.Ссылка.Дата КАК ДатаСобытия,
		|	алк_АктСписанияПортЗапасы.Ссылка.Дата КАК Период,
		|	алк_АктСписанияПортЗапасы.СерийныйНомер,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииСерийныхНомеров.Судно) КАК Операция,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика
		|ИЗ
		|	Документ.алк_АктСписанияПорт.Запасы КАК алк_АктСписанияПортЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО алк_АктСписанияПортЗапасы.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	алк_АктСписанияПортЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период,
		|	&ВидДвиженияНакопленияРасход КАК ВидДвижения,
		|	алк_АктСписанияПортЗапасы.Ссылка.Организация,
		|	алк_АктСписанияПортЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	алк_АктСписанияПортЗапасы.Номенклатура,
		|	алк_АктСписанияПортЗапасы.Характеристика,
		|	ВЫБОР
		|		КОГДА алк_АктСписанияПортЗапасы.Номенклатура.Код = ""ПБ-00000018""
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
		|		ИНАЧЕ алк_АктСписанияПортЗапасы.СерийныйНомер
		|	КОНЕЦ КАК СерийныйНомер,
		|	ВЫБОР
		|		КОГДА алк_АктСписанияПортЗапасы.Номенклатура.Код = ""ПБ-00000018""
		|			ТОГДА алк_АктСписанияПортЗапасы.ВесНетто
		|		ИНАЧЕ алк_АктСписанияПортЗапасы.ОбъемТаможня
		|	КОНЕЦ КАК Количество,
		|	алк_АктСписанияПортЗапасы.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.алк_АктСписанияПорт.Запасы КАК алк_АктСписанияПортЗапасы
		|ГДЕ
		|	алк_АктСписанияПортЗапасы.Ссылка = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАктСписанияПорт);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаАктСписанияПорт.Дата);
		
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияПриход", ВидДвиженияНакопления.Приход);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаВнСкладахСерии", МассивРезультатов[0].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСерийныеНомераГарантии", МассивРезультатов[1].Выгрузить());
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиЗапасов", МассивРезультатов[2].Выгрузить());
		

	КонецПроцедуры
	
	
	#КонецОбласти
	
	
#КонецЕсли
